<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Processing Dist/DS Repo copier</string>
	<key>Identifier</key>
	<string>com.github.ocadu.dist.ds.processing</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Processing</string>
	</dict>
	<key>Input</key>
    <dict>
        <key>DS_PKGS_PATH</key>
        <string>/Volumes/Storage/DeployStudioFS/Packages</string>
        <key>DS_NAME</key>
        <string>%NAME%</string>
    </dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.pkg.processing</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>com.github.ocadu.SharedProcessors/DistPkgConverter</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg_path</key>
                <string>%pkg_path%</string>
                <key>destination_pkg</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
            </dict>
            <key>SharedProcessorRepoURL</key>
            <string>https://github.com/ocadudeployment/autopkg-recipes</string>
        </dict>
		    <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                <key>destination_path</key>
                <string>%DS_PKGS_PATH%/%DS_NAME%.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
	</array>
</dict>
</plist>
