<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Creates an LANrev package (.amsdpackages), imports it into the LANrev Admin console and uploads it to the LANrev Server.</string>
    <key>Identifier</key>
    <string>com.github.ocadu.LANrev.Adobe.CreativeCloudApp</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CreativeCloudApp</string>
        <key>ccpinfo</key>
		<dict>
			<key>Language</key>
			<string>en_US</string>
			<key>Products</key>
			<array>
				<dict>
					<key>baseVersion</key>
					<string></string>
					<key>sapCode</key>
					<string></string>
					<key>version</key>
					<string>latest</string>
				</dict>
			</array>
			<key>adminPrivilegesEnabled</key>
			<false/>
			<key>appsPanelEnabled</key>
			<false/>
			<key>customerType</key>
			<string>enterprise</string>
			<key>matchOSLanguage</key>
			<true/>
			<key>organizationName</key>
			<string>ADMIN_PLEASE_CHANGE</string>
			<key>rumEnabled</key>
			<true/>
			<key>updatesEnabled</key>
			<false/>
		</dict>
	<key>min_os</key>
	<string>OSX10.9</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.mosen.pkg.Adobe.CreativeCloudApp</string>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.jbaker10.LANrevImporter/LANrevImporter</string>
            <key>Arguments</key>
            <dict>
                <key>dest_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.amsdpackages</string>
                <key>sdpackages_ampkgprops_path</key>
                <string>%RECIPE_DIR%/%NAME%-Defaults.ampkgprops</string>
                <key>source_payload_path</key>
                <string>%pkg_path%</string>
                <key>import_pkg_to_servercenter</key>
                <true/>
            </dict>
            <key>SharedProcessorRepoURL</key>
            <string>https://github.com/jbaker10/LANrevImporter</string>
        </dict>
    </array>
</dict>
</plist>
