<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Excel multilingual update pkg,
appends the version to the end of the filename, and imports into
Munki.
</string>
    <key>Identifier</key>
    <string>com.github.ocadu.munki.MicrosoftExcel</string>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MicrosoftExcel</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>munki_required_update_name</key>
        <string></string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>Microsoft Excel</string>
                <string>Microsoft Error Reporting</string>
                <string>Microsoft AutoUpdate</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>developer</key>
            <string>Microsoft</string>
            <key>display_name</key>
            <string>Microsoft Excel for Mac</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.microsoftexcel365</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>Merge input pkginfo and additional_pkginfo generated by MSOffice2016URLandUpdateInfoProvider</string>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>version_comparison_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>